authenticate-me/app/models/user.rb

  def self.find_by_credentials(credentials, password)
#validation checker extra work
    if URI::MailTo::EMAIL_REGEXP.match?(credentials)
      user = User.find_by(email: credentials)
    else
      user = User.find_by(username: credentials)
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Demo-lition"], ["LIMIT", 1]]

  def reset_session_token!
    self.update!(session_token: generate_unique_session_token)
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2023-02-01 15:46:47.551666"], ["id", 1]]

  def generate_unique_session_token
    loop do
      token = SecureRandom.base64
      break token unless User.exists?(session_token: token)
---
SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]