authenticate-me/app/controllers/api/sessions_controller.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2023-02-01 16:56:11.336273"], ["id", 1]]
---
  def create
      credentials = params[:credential]
      password = params[:password]

      @user = User.find_by_credentials(credentials, password)

      if @user.save